/*
        عايز اتحكم في الوقت بتاع الانتقال من صورة لاخري يعني وقت عرض الصور فعن طريق ملف الجافا سكريبت فهعمل ملف جديد واعمل فيه التعديلات او اي حاجة جديدة عايز اضيفها وبكتب فيه كود
        عبارة عن احد مكتبات الجافاسكريبت JQuery حيث ال JQuery جافاسكريبت و
*/
$(document).ready(function(){
    $("#myCarousel").carousel({              //  id باسم الكلاس او ال carousel علي ال select ممكن اعمل
        /* هحط فيه الخواص الجديدة حيث بقول له خلي الوقت بين الانتقال من صورة لاخري بيساوي 3 ثانية يعني اظهر صورة او انتقل للصورة التالية بعد ثلاث ثواني بس خلي بالك ان لما احط
         timer يعني هيتم ايقاف ال user الفارة علي السليدر فاللي عيتحكم في الانتقال من صورة لاخري هو ال
        */
        interval:3000
    });
    // show colorBox Div when click on the Gear icon هيظهر الصندوق عند الضغط علي الايقونة لو مخفي وهيخفيه لو ظاهر
    // حيث هقول له لما اضغط علي الايقونة فالو الصندوق بتاع الالوان مخفي اظهره ولو ظاهر اخفيه بس هيغير في الشفافية
    $(".gearCheck").click(function(){  
                          $(".colorBox").fadeToggle();
      });
/************ lesson38: change color from option box هبدا اخلي لون العناصر هو اللون اللي العميل هيختاره من صندوق الالون *
 css ويستدعيه ويخليه هو ملف ال style يعني لما اضغط علي لون معين في الصندوق بتاع الالون يروح يستدعي ملف ال
*******************************  change theme color on click ***********************
1- eq(indexOfElemnt) عن طريق ال li فعشان اوصل للعناصر اللي داخل ال ul فهلون عنصر عنصر داخل ال colorBox بتاع ال ul اللي بداخل ال li عايز الون ال 
المكونة من اكثر من مقط فبكتب اول حرف من الكلمة الثانية كابيتل والدالة css وخلي بالك في الخواص بتاعت ال 
 وفي هذا المثال هيكون هو ال select بترجعني للعنصر الاصلي اللي انا عامل عليه first-state وبترجع العنصر للحالة الاولي له chain بتنهي السلسلة end()
  عشان ادخل علي العنصر الثاني في القائمة حيث بدل ما اعمل ".colorBox ul li"
  $(".colorBox ul li").eq(0).css("backgroundColor","#E41B17");
  $(".colorBox ul li").eq(1).css("backgroundColor","#E41B17");
  فالحل الاسهل هو الاتي 
   $(".colorBox ul li").eq(0).css("backgroundColor","#E41B17").end().eq(1).css("backgroundColor","#E41B17").end()
  
  
  
***/
    var colorLi=$(".colorBox ul li"); /* عشان هستخدم اسم الكلاس اكثر من مرة فهعرفه في متغير */
     colorLi
    .eq(0).css("backgroundColor","#E41B17").end()   /* is the first <li> */ 
    .eq(1).css("backgroundColor","#E426D5").end()   /* is the second <li> */
    .eq(2).css("backgroundColor","#009AFF").end()   /* is the third <li> */
    .eq(3).css("backgroundColor","#ffa115");        /* is the fourth <li> */
/* بتاع اللون اللي انا ضغط عليه فعشان اعمل كده لازم اعمل css ويستدعي ملف ال css يغير ملف ال colorBox عايز لما اضغط علي احد الالوان اللي موجودة  داخل ال 
حيث هحط فيها اسم الملف بتاع  html5 عبارة خاصية موجودة في ال data-value اسمها  attribute  خاصية <li> حيث هضيف لل <li> لل custom attribute 
 عشان لما اضغط علي لون معين يغير من ملف لملف اخر JQUeryوهعتمد عليه في ال style ال
 <li data-value="css/defaultColorTheme.css"></li>
 li اللي في الصفحة لهذا المسار اللي انا كتبته في ال style بتاع ال attribute  يحول لي ال li معناه اني لما اضغط علي ال 
 href وهتشيل الثيمة اللي موجودة داخل ال  href اللي اسمه  attribute ثم بعد ذلك هتدخل علي ال <link> هتقوم بالبحث عن التاج اللي اسمه JQuery حيث ال
   <link > بتاع ال href في ال li اللي موجودة في ال data-value وتحط القيمة اللي موجودة في ال
*/
    /* يعني عند الضغط علي لون معين هخليه يبحث لي في الصفحة علي اللينك اللي اسمه coloBox بتاعت ال ul اللي موجودة في ال li بقول له لما اضغط علي ال 
    يعني الملف الافتراضي  css/defaultColorTheme.css
    */
    colorLi.click(function(){
    /* اللي انا ضغط عليها li بتاع ال data-value اللي اسمه attr اللي انا ضغط عليها يعني اطبع لي قيمة ال li بتاع ال data-value هخليه يطبع قيمة ال */
    /*
    css/defaultColorTheme.css بتعته بتساوي كذا فمش هينفع اكتب اللينك كله ذي href هقول له ابحث لي عن لينك معين حيث ال 
    ... او orange او purple ممكن تكون default لان الجملة هتختلف من عنصر لاخر حيث مثلا كلمة 
    موجودة في كل اللينكات Theme فهبحث عن كلمة يشترك فيها كل اللينكات يعني موجودة في كل اللينكات ذي كلمة 
    $("link[href *='Theme']")     Theme معني النجمة وبعده كلمة هو اني بقول له ابحص لي علي لينك يحتوي علي كلمة   
        */
      /*  console.log( $("link[href*='Theme']"));
        $("link[href*='Theme']").remove(); /* الافتراضي style هيمسح قيمة اللينك بتاع الصفحة حيث ملف ال */
        /* console.log($(this).attr("data-value")); 
    /* بتاع هذا اللينك وحط مكانه href فالو وجدتها فغير قيمة ال Theme بتاعه يحتوي علي كلمة href وابحث عن اللينك اللي قيمة ال <link>بقول له ابحث عن التاج اللي اسمه
       colorBox اللي انا ضغط عليه في ال li بتاع ال data-value قيمة ال 
    */
        $("link[href*='Theme']").attr("href",$(this).attr("data-value") ); 
  
       /* بتاع الملف بتاع الالوان link لل href اللي انا ضغط عليها كقيمة لل li بتاع ال data-value هحط القيمة اللي في ال */
        /* بتع العنصر اللي ضغط عليه  data-valueعلي العنصر اللي كنت بتكلم عنه دلوقتي واطبع لي قيمة ال selectمعناها اعمل */
    });
    /******************************** lesson40: start create scroll To Top Button *****************************/
     var scrollButton=$("#scrollTop");
    $(window).scroll(function(){     /*  في الصفحة نفذ الاتي يعني لما اضغط علي البكرة scroll لما اعمل */
        console.log( $(this).scrollTop() ) 
        /* window  عادة علي ال this حيث ال  scrollTop() هطبع القيمة اللي نزلتها من الصفحة يعني كل ما نزلت بالبكرة للاسفل كل ما زاد قيمة ال */
        if($(this).scrollTop() >=1000 ) /*بقول له لو نزلت بمقدار 1000 فهيظهر الزرار*/
            {
                scrollButton.show();
            }  
        else            /* ولو مقدار اللي انا نزلته من الصفحة كان اقل من ال 1000 فهيخفي الزرار عشان لما اطلع بالبكرة وتكون القيمة اقل من 1000 هيخفي الزرار */
            {
                scrollButton.hide();
            }
    /*  المختصرة if لو عايز اختصر الجملة الشرطية في سطر واحد فهكتب جملة 
       ($(this).scrollTop() >=1000 )?scrollButton.show():scrollButton.hide() 
       (condition)?statementTrue:statementFalse
    */
    });
    // click on button To scroll top
    scrollButton.click(function(){ 
        /*  بتعهم ب 0 بس خليها بشكل ناعم scrollTop يعني ال  html وال body بقول له لما اضغط علي الزرار هيخلي المسافة اللي نزلتها من ال*/
        $("html , body ").animate( {scrollTop : 0 } , 700);
    });
    
});
/********************** Lesson16 : End testimonials section  اراء الناس عن الموقع الدقيقة**************************/

/************ lesson39: start create Loading Screen هعمل علامة التعديل لحظة فتح الموقع كاني لموقع بيحمل 
css3 حيث بيكون عبارة عن شكل كويس بيظهر امامك لاحظة فتح الموقع حتي يتم تحميل كل عناصر الصفحة فهيبدا انه يظهر الصفحة حيث بيكون عبارة عن شكل متحرك معمول بال 
وبعمل علامة التحميل عشان العميل ميشفش الصفحة وهيه بتحمل فهيكون شكلها مش كويس فهعمل له شكل متحرك يندمج معاه حتي الصفحة يتم تحميلها
 فبعمل ديف كامل يملي الصفحة كلها ويكون لونه مظلم يتم وضعه فوق الموقع كله عشان الشخص يشوف الديف ويشوف علامة التحميل حتي يتم تحميل الصفحة loader عشان اعمل ال
 ولاحظ اني حطيت السكشن بتاع التحميل في اخر الصفحة لانه كد كده ملهوش مكان محدد حيث يكون فوق كل الموقع وهيكون عنصر موقت 
  فهكتب الكود خارج ال window  يتحمل ويظهر لما النافذه كلها تتحمل يعني ال loader عشان عايز ال $(document).ready() خارج ال loader هكتب كود ال 
  $(document).ready()
*****************/
/* لما الصفحة يحصل لها تحميل ويحصل تحميل لكل العناصر اللي بداخلها نفذ لي الكود ده */
$(window).load(function(){
 // css , js , html code حيث بيكون لها كود جاهز سواء spinner loader  وهيكون شكله عند تحميل الصفحة مش حلو فهحط شكل ايقونة اسمها  h1  بدل ما احط 
    $(".loadingOverlay .spinner").fadeOut(1000,function(){ 
/*
        هخليه يخفي السكشن اللي مالي الصفحة وله اسود فشعان اوصل له هقول له هات الاب بتاع العنصر الحالي اللي هوه ال spinner بعد ما يخفي ال
        واخفيه بعد ثانية  this=".spinner"حيث ".spinner"
*/

         $("body").css("overflow","auto"); /* fadeOut عشان اخلي البكرة تظهر بعد ما الصفحة تحمل مش لحظة ما الصفحة تحمل يعني تتنفذ بعد ال */
        /*
  overLay-loader .spinner ال
  خلي بالك انه بيلعب في الشفافية مش في الطول والعرض يعني هيخلي overLay-loader section هيختفي بعد ثلاث ثواني ويعد كده هخليه يخفي ال
          opacity = 0 هيخليها opacity = 1 ال
        */
         $(this).parent().fadeOut(1000,function(){
             /* ويخفي العنصر ويظهره display عشان محدش يلعب في الخاصية  html بعد مايخفي السكشن اللي بيخلي الشاشة لونها مظلم فهحذف هذا السكشن من كود ال */
             $(this).remove();  // $(".loadingOverlay h2").parent() اللي هوه السكشن parent عادة علي ال  this ال 
         }); 
    });  
    /* 
    يعني السكشن المظلم اللي كان مغطي علي الصفحة اخفيه بس فيه مشكلة ان البكرة هتكون مختفيه فعايز اظهرها loader هقول له اخفي لي السكشن بتاع ال 
    */
   
}); 
/************************************ lesson40: start create scroll To Top Button *****************************/



/************************************ lesson40: End create scroll To Top Button *****************************/



/************ lesson38: End create Loading Screen هعمل علامة التعديل لحظة فتح الموقع كاني لموقع بيحمل  *****************/






